tutorials/lagrangian/steadyReactingParcelFoam/verticalChannel/constant/reactions
species
(
    air
    H2O
);

reactions
{}

