tutorials/lagrangian/steadyReactingParcelFoam/verticalChannel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        0;
        relTol           0.1;

        smoother         DICGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;

        maxIter          20;
    };
    "(rho|G)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        0;
        relTol           0.1;
        maxIter          20;
    };
    "(Yi|hs)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        0;
        relTol           0.1;
        maxIter          20;
    };
    "(U|k|omega)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        0;
        relTol           0.1;
        maxIter          20;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0; // 10;
    momentumPredictor yes;
    rhoMin rhoMin [ 1 -3 0 0 0 ] 0; // 0.5;
    rhoMax rhoMax [ 1 -3 0 0 0 ] 100; // 1.5;
}

relaxationFactors
{
    p               0.3;
}

additional
{
    eWork           true;
    hWork           true;
    solveSpecies    true;
}


// ************************************************************************* //
