tutorials/lagrangian/steadyReactingParcelFoam/verticalChannel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# create mesh
runApplication blockMesh

# run the solver
runApplication steadyReactingParcelFoam

# ----------------------------------------------------------------- end-of-file
